[
    {
        "name": "Leg of Lamb",
        "category_slug": "lamb-roasts",
        "short_description": "Premium whole leg for roasting",
        "description": "A classic Australian grass-fed leg of lamb, perfect for traditional Sunday roasts and special occasions. This premium cut features tender, succulent meat with a delicate flavor that pairs beautifully with rosemary and garlic. Slow roast to perfection for a centerpiece meal that feeds the whole family.",
        "price_aud": 24.99,
        "unit": "kg",
        "weight_kg": 2.0,
        "stock": 60,
        "is_featured": true,
        "image_path": "/images/products/lamb/leg-of-lamb.jpg"
    },
    {
        "name": "Lamb Leg Chops",
        "category_slug": "lamb-chops-cutlets",
        "short_description": "Meaty chops from the leg",
        "description": "Succulent Australian lamb leg chops featuring a perfect balance of tender meat and minimal bone. These versatile chops are ideal for grilling, barbecuing, or pan-frying, delivering sweet, mild lamb flavor. A family favorite that's economical and quick to prepare for weeknight dinners.",
        "price_aud": 24.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 100,
        "is_featured": false,
        "image_path": "/images/products/lamb/lamb-leg-chops.jpg"
    },
    {
        "name": "Lamb Chump Chops",
        "category_slug": "lamb-chops-cutlets",
        "short_description": "Premium chops from the rump",
        "description": "Premium Australian chump chops cut from the rump end of the loin, featuring a beautiful eye of tender meat. These thick, juicy chops offer excellent value with generous portions and minimal waste. Perfect for grilling or barbecuing, they deliver rich lamb flavor with exceptional tenderness.",
        "price_aud": 34.99,
        "unit": "kg",
        "weight_kg": 0.4,
        "stock": 80,
        "is_featured": false,
        "image_path": "/images/products/lamb/lamb-chump-chops.jpg"
    },
    {
        "name": "Lamb Loin Chops",
        "category_slug": "lamb-chops-cutlets",
        "short_description": "Premium loin chops with T-bone",
        "description": "The premium choice for lamb lovers, these Australian grass-fed loin chops feature both loin and fillet separated by a T-bone. Incredibly tender with delicate marbling, these elegant chops are perfect for special occasions. Quick to cook and restaurant-quality, they're best served pink for maximum flavor.",
        "price_aud": 34.99,
        "unit": "kg",
        "weight_kg": 0.4,
        "stock": 70,
        "is_featured": true,
        "image_path": "/images/products/lamb/lamb-loin-chops.jpg"
    },
    {
        "name": "Lamb Grilling Chops",
        "category_slug": "lamb-chops-cutlets",
        "short_description": "Perfect chops for BBQ grilling",
        "description": "Premium Australian lamb chops specifically selected and cut for optimal grilling. These well-marbled chops are ideal for barbecues, delivering consistent results with beautiful char and juicy interiors. Pre-cut to the perfect thickness for even cooking, they're the BBQ enthusiast's choice.",
        "price_aud": 31.99,
        "unit": "kg",
        "weight_kg": 0.45,
        "stock": 90,
        "is_featured": false,
        "image_path": "/images/products/lamb/lamb-grilling-chops.jpg"
    },
    {
        "name": "Lamb Cutlets",
        "category_slug": "lamb-chops-cutlets",
        "short_description": "Premium French-trimmed cutlets",
        "description": "Elegant French-trimmed Australian lamb cutlets from the rack, featuring a long, clean bone and tender eye of meat. These restaurant-quality cutlets are the pinnacle of lamb dining, perfect for elegant entertaining. Quick-cooking and naturally tender, they're best served pink with a delicate seasoning.",
        "price_aud": 55.99,
        "unit": "kg",
        "weight_kg": 0.3,
        "stock": 60,
        "is_featured": true,
        "image_path": "/images/products/lamb/lamb-cutlets.jpg"
    },
    {
        "name": "Crumbed Lamb Cutlets",
        "category_slug": "lamb-chops-cutlets",
        "short_description": "Restaurant-style breaded cutlets",
        "description": "Premium Australian lamb cutlets coated in our signature golden breadcrumb mixture, ready to cook. These restaurant-style prepared cutlets save preparation time while delivering gourmet results. Simply pan-fry or bake for crispy, golden cutlets with tender, juicy meat inside. Family-friendly and elegant.",
        "price_aud": 55.99,
        "unit": "kg",
        "weight_kg": 0.35,
        "stock": 50,
        "is_featured": false,
        "image_path": "/images/products/lamb/crumbed-lamb-cutlets.jpg"
    },
    {
        "name": "Lamb Neck Chops",
        "category_slug": "lamb-chops-cutlets",
        "short_description": "Flavorful chops for slow cooking",
        "description": "Rich, flavorful Australian lamb neck chops perfect for slow-cooked dishes and braising. This economical cut develops incredible depth of flavor and fall-apart tenderness when cooked low and slow. Ideal for hearty stews, curries, and traditional Middle Eastern dishes.",
        "price_aud": 24.99,
        "unit": "kg",
        "weight_kg": 0.6,
        "stock": 80,
        "is_featured": false,
        "image_path": "/images/products/lamb/lamb-neck-chops.jpg"
    },
    {
        "name": "Lamb Necks",
        "category_slug": "lamb-roasts",
        "short_description": "Whole necks for rich stocks and stews",
        "description": "Whole Australian lamb necks prized for their rich, gelatinous meat and bone-in flavor. Perfect for slow-braising, these create incredibly flavorful stocks, broths, and stews. An economical choice that delivers restaurant-quality depth of flavor with traditional cooking methods.",
        "price_aud": 24.99,
        "unit": "kg",
        "weight_kg": 0.8,
        "stock": 60,
        "is_featured": false,
        "image_path": "/images/products/lamb/lamb-necks.jpg"
    },
    {
        "name": "Lamb Shanks",
        "category_slug": "lamb-roasts",
        "short_description": "Premium shanks for slow braising",
        "description": "Premium Australian grass-fed lamb shanks, the ultimate comfort food cut. When slow-braised with red wine and aromatics, these shanks become incredibly tender, with meat that falls off the bone. The marrow-rich bones add luxurious depth to sauces, creating restaurant-quality meals at home.",
        "price_aud": 24.99,
        "unit": "kg",
        "weight_kg": 0.4,
        "stock": 90,
        "is_featured": true,
        "image_path": "/images/products/lamb/lamb-shanks.jpg"
    },
    {
        "name": "Lamb Cutlet Racks",
        "category_slug": "lamb-roasts",
        "short_description": "Elegant French-trimmed rack",
        "description": "The crown jewel of lamb cuts, our Australian grass-fed racks feature French-trimmed bones and a perfect eye of tender meat. This premium roast is ideal for elegant entertaining and special celebrations. Roast pink for an impressive presentation with exceptional flavor and tenderness.",
        "price_aud": 51.99,
        "unit": "kg",
        "weight_kg": 0.6,
        "stock": 40,
        "is_featured": true,
        "image_path": "/images/products/lamb/lamb-cutlet-racks.jpg"
    },
    {
        "name": "Gourmet Lamb Roast",
        "category_slug": "lamb-roasts",
        "short_description": "Premium boneless roasting joint",
        "description": "A premium boneless Australian lamb roast expertly trimmed and tied for even cooking. This versatile cut is perfect for stuffing and rolling with herbs, creating elegant dinner party centerpieces. Easy to carve and consistently tender, it delivers gourmet results with minimal effort.",
        "price_aud": 27.99,
        "unit": "kg",
        "weight_kg": 1.2,
        "stock": 50,
        "is_featured": false,
        "image_path": "/images/products/lamb/gourmet-lamb-roast.jpg"
    },
    {
        "name": "Easy Carve Leg of Lamb",
        "category_slug": "lamb-roasts",
        "short_description": "Tunnel-boned for easy serving",
        "description": "Premium Australian leg of lamb with the bone removed through a tunnel, making carving effortless while retaining the traditional leg shape. This innovative preparation ensures even cooking and simple serving, perfect for hosts who want convenience without compromising on presentation or flavor.",
        "price_aud": 24.99,
        "unit": "kg",
        "weight_kg": 1.8,
        "stock": 55,
        "is_featured": false,
        "image_path": "/images/products/lamb/easy-carve-leg-of-lamb.jpg"
    },
    {
        "name": "Marinated Lamb Chops",
        "category_slug": "lamb-chops-cutlets",
        "short_description": "Pre-marinated chops ready to cook",
        "description": "Premium Australian lamb chops infused with our signature herb and garlic marinade. Pre-marinated to deliver maximum flavor and tenderness, these chops are ready for the grill or pan. Perfect for busy weeknights and easy entertaining with guaranteed delicious results every time.",
        "price_aud": 24.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 85,
        "is_featured": false,
        "image_path": "/images/products/lamb/marinated-lamb-chops.jpg"
    },
    {
        "name": "Lamb Stir Fry",
        "category_slug": "lamb-mince",
        "short_description": "Tender strips ready for stir-frying",
        "description": "Premium Australian lamb cut into thin strips perfect for quick stir-frying. These tender pieces cook in minutes and absorb Asian flavors beautifully, creating healthy, protein-rich meals in under 15 minutes. Ideal for busy families seeking quality, convenience, and authentic stir-fry results.",
        "price_aud": 30.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 70,
        "is_featured": false,
        "image_path": "/images/products/lamb/lamb-stir-fry.jpg"
    },
    {
        "name": "Lean Diced Lamb",
        "category_slug": "lamb-mince",
        "short_description": "Premium cubed lamb for curries",
        "description": "Premium Australian lamb expertly diced and trimmed for maximum leanness. Perfect for slow-cooked curries, tagines, and stews, these cubes develop exceptional tenderness and absorb spices beautifully. A versatile, healthy choice that delivers authentic flavor in traditional recipes.",
        "price_aud": 30.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 80,
        "is_featured": false,
        "image_path": "/images/products/lamb/lean-diced-lamb.jpg"
    },
    {
        "name": "Mini Lamb Roast",
        "category_slug": "lamb-roasts",
        "short_description": "Perfect single-portion roast",
        "description": "Perfectly portioned Australian mini lamb roast ideal for couples or small families. This individual roasting joint delivers all the flavor and tenderness of a traditional roast in a convenient size. Quick-cooking and easy to prepare, it's perfect for modern households without waste.",
        "price_aud": 30.99,
        "unit": "kg",
        "weight_kg": 0.6,
        "stock": 60,
        "is_featured": false,
        "image_path": "/images/products/lamb/mini-lamb-roast.jpg"
    },
    {
        "name": "Lamb Drum Sticks",
        "category_slug": "lamb-roasts",
        "short_description": "Frenched lamb shanks for easy eating",
        "description": "Innovative French-trimmed lamb shanks with a clean bone handle, creating a fun, easy-to-eat format. These Australian lamb drumsticks are perfect for slow-braising or grilling, offering all the flavor of traditional shanks in a more convenient, family-friendly presentation.",
        "price_aud": 21.99,
        "unit": "kg",
        "weight_kg": 0.35,
        "stock": 70,
        "is_featured": false,
        "image_path": "/images/products/lamb/lamb-drum-sticks.jpg"
    },
    {
        "name": "Lambs Fry",
        "category_slug": "lamb-mince",
        "short_description": "Traditional liver for frying",
        "description": "Premium Australian lamb liver, prized for its tender texture and rich, distinctive flavor. This nutrient-dense organ meat is a traditional favorite, perfect for pan-frying with bacon and onions. Fresh, carefully prepared, and ideal for those who appreciate classic British and Australian fare.",
        "price_aud": 8.99,
        "unit": "kg",
        "weight_kg": 0.4,
        "stock": 40,
        "is_featured": false,
        "image_path": "/images/products/lamb/lambs-fry.jpg"
    },
    {
        "name": "Lamb Kidneys",
        "category_slug": "lamb-mince",
        "short_description": "Delicate organ meat for traditional dishes",
        "description": "Tender Australian lamb kidneys with a mild, delicate flavor compared to other organ meats. Essential for authentic steak and kidney pies, these kidneys are also delicious deviled or grilled. Fresh, carefully prepared, and perfect for adventurous cooks exploring traditional cuisine.",
        "price_aud": 2.99,
        "unit": "kg",
        "weight_kg": 0.3,
        "stock": 30,
        "is_featured": false,
        "image_path": "/images/products/lamb/lamb-kidneys.jpg"
    },
    {
        "name": "Mongolian Lamb Chops",
        "category_slug": "lamb-chops-cutlets",
        "short_description": "Asian-style marinated chops",
        "description": "Premium Australian lamb chops marinated in our authentic Mongolian sauce blend featuring soy, ginger, and garlic. These pre-marinated chops deliver bold Asian flavors and are ready for quick grilling or stir-frying. A favorite for those seeking convenient, restaurant-quality Asian cuisine at home.",
        "price_aud": 27.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 65,
        "is_featured": false,
        "image_path": "/images/products/lamb/mongolian-lamb-chops.jpg"
    },
    {
        "name": "H/M Lamb Chops (Honey Mustard)",
        "category_slug": "lamb-chops-cutlets",
        "short_description": "Honey mustard marinated chops",
        "description": "Succulent Australian lamb chops marinated in our signature honey mustard glaze. This perfect balance of sweet honey and tangy mustard creates caramelized, flavorful chops that please all palates. Pre-marinated for convenience, they're perfect for quick grilling with gourmet results.",
        "price_aud": 27.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 70,
        "is_featured": false,
        "image_path": "/images/products/lamb/honey-mustard-lamb-chops.jpg"
    },
    {
        "name": "H/R Lamb Chops (Honey Rosemary)",
        "category_slug": "lamb-chops-cutlets",
        "short_description": "Honey rosemary marinated chops",
        "description": "Premium Australian lamb chops infused with honey and fresh rosemary, a classic combination that enhances lamb's natural sweetness. This traditional pairing creates aromatic, tender chops with a beautiful glaze. Pre-marinated for your convenience, they're perfect for elegant yet effortless entertaining.",
        "price_aud": 27.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 70,
        "is_featured": false,
        "image_path": "/images/products/lamb/honey-rosemary-lamb-chops.jpg"
    },
    {
        "name": "Lamb Shoulder",
        "category_slug": "lamb-roasts",
        "short_description": "Flavorful shoulder for slow roasting",
        "description": "A richly marbled Australian lamb shoulder perfect for slow roasting or braising. This economical cut transforms into incredibly tender, fall-apart meat when cooked low and slow. Ideal for pulled lamb, traditional roasts, or Middle Eastern preparations, it delivers exceptional flavor and value.",
        "price_aud": 27.99,
        "unit": "kg",
        "weight_kg": 1.5,
        "stock": 55,
        "is_featured": false,
        "image_path": "/images/products/lamb/lamb-shoulder.jpg"
    },
    {
        "name": "Lamb Forequarter",
        "category_slug": "lamb-roasts",
        "short_description": "Economical cut for family roasts",
        "description": "A traditional Australian lamb forequarter featuring excellent flavor and versatility at an economical price. This larger cut is perfect for family gatherings, slow-roasting with vegetables, or portioning into chops. A budget-friendly choice that doesn't compromise on taste or quality.",
        "price_aud": 26.99,
        "unit": "kg",
        "weight_kg": 1.8,
        "stock": 45,
        "is_featured": false,
        "image_path": "/images/products/lamb/lamb-forequarter.jpg"
    }
]
