[
    {
        "name": "Rump Steak",
        "category_slug": "beef-steaks",
        "short_description": "Tender, full-flavored grass-fed rump steak",
        "description": "Premium Australian grass-fed rump steak, renowned for its rich beefy flavor and tender texture. Perfect for grilling, pan-frying, or barbecuing, this versatile cut delivers exceptional taste with beautiful natural marbling. Ideal for steak lovers seeking quality and value.",
        "price_aud": 34.99,
        "unit": "kg",
        "weight_kg": 0.3,
        "stock": 100,
        "is_featured": false,
        "image_path": "/images/products/beef/rump-steak.jpg"
    },
    {
        "name": "T-Bone Steak",
        "category_slug": "beef-steaks",
        "short_description": "Classic T-bone with sirloin and tenderloin",
        "description": "The ultimate steak experience featuring both tenderloin and strip loin separated by the iconic T-shaped bone. This Australian grass-fed cut offers two distinct textures and flavors in one premium steak. Perfect for grilling, it delivers restaurant-quality results with exceptional marbling and succulence.",
        "price_aud": 34.99,
        "unit": "kg",
        "weight_kg": 0.4,
        "stock": 80,
        "is_featured": true,
        "image_path": "/images/products/beef/t-bone-steak.jpg"
    },
    {
        "name": "New York Cut Steak",
        "category_slug": "beef-steaks",
        "short_description": "Premium strip loin with exceptional marbling",
        "description": "Indulge in this premium Australian grass-fed New York strip, celebrated for its bold flavor and tender texture. Expertly cut from the short loin, this steak features beautiful marbling that melts during cooking, creating a buttery, succulent experience. The gold standard for steak connoisseurs.",
        "price_aud": 55.99,
        "unit": "kg",
        "weight_kg": 0.35,
        "stock": 60,
        "is_featured": true,
        "image_path": "/images/products/beef/new-york-cut-steak.jpg"
    },
    {
        "name": "Scotch Fillet",
        "category_slug": "beef-steaks",
        "short_description": "Tender, well-marbled ribeye steak",
        "description": "Our premium Australian Scotch fillet (ribeye) is the epitome of beef excellence, featuring exceptional marbling and a tender, melt-in-your-mouth texture. This highly sought-after cut delivers intense flavor and buttery richness, making it perfect for special occasions. Best grilled or pan-seared to medium-rare.",
        "price_aud": 55.99,
        "unit": "kg",
        "weight_kg": 0.35,
        "stock": 70,
        "is_featured": true,
        "image_path": "/images/products/beef/scotch-fillet.jpg"
    },
    {
        "name": "Eye Fillet Steak",
        "category_slug": "beef-steaks",
        "short_description": "Ultra-tender premium tenderloin",
        "description": "The most tender cut of beef available, our Australian grass-fed eye fillet (tenderloin) is the ultimate luxury steak. Prized for its buttery texture and subtle, refined flavor, this lean yet succulent cut requires minimal seasoning and gentle cooking. The premium choice for those who appreciate the finest quality beef.",
        "price_aud": 59.99,
        "unit": "kg",
        "weight_kg": 0.25,
        "stock": 50,
        "is_featured": true,
        "image_path": "/images/products/beef/eye-fillet-steak.jpg"
    },
    {
        "name": "X-Cut Blade",
        "category_slug": "beef-steaks",
        "short_description": "Flavorful, economical blade steak",
        "description": "A budget-friendly favorite featuring excellent flavor and a distinctive cross-section of connective tissue. This Australian grass-fed cut is perfect for slow cooking, braising, or grilling, developing rich, deep flavors. Great value for family meals and everyday cooking.",
        "price_aud": 25.99,
        "unit": "kg",
        "weight_kg": 0.35,
        "stock": 120,
        "is_featured": false,
        "image_path": "/images/products/beef/x-cut-blade.jpg"
    },
    {
        "name": "Round Steak",
        "category_slug": "beef-steaks",
        "short_description": "Lean, versatile beef steak",
        "description": "A lean, versatile cut from the hindquarter of Australian grass-fed beef, ideal for slow cooking, stir-fries, or braising. Round steak becomes wonderfully tender when cooked with moisture, making it perfect for casseroles and stews. An economical choice that delivers great flavor and nutrition.",
        "price_aud": 25.99,
        "unit": "kg",
        "weight_kg": 0.4,
        "stock": 100,
        "is_featured": false,
        "image_path": "/images/products/beef/round-steak.jpg"
    },
    {
        "name": "Topside Steak",
        "category_slug": "beef-steaks",
        "short_description": "Lean premium steak cut",
        "description": "Cut from the inner thigh of Australian grass-fed beef, topside steak is a lean, flavorful cut perfect for quick cooking methods. Best served medium-rare and sliced thinly against the grain, this versatile steak works beautifully in stir-fries, sandwiches, or as a quality family meal option.",
        "price_aud": 25.99,
        "unit": "kg",
        "weight_kg": 0.35,
        "stock": 90,
        "is_featured": false,
        "image_path": "/images/products/beef/topside-steak.jpg"
    },
    {
        "name": "Roast Silverside",
        "category_slug": "beef-roasts",
        "short_description": "Classic lean roasting joint",
        "description": "A traditional Australian favorite, silverside is a lean, boneless cut from the hindquarter perfect for slow roasting or pot roasting. This versatile joint develops wonderful flavor when cooked with vegetables and herbs, creating tender, succulent slices ideal for Sunday roasts or cold meat platters.",
        "price_aud": 25.99,
        "unit": "kg",
        "weight_kg": 1.5,
        "stock": 60,
        "is_featured": false,
        "image_path": "/images/products/beef/roast-silverside.jpg"
    },
    {
        "name": "Corned Silverside",
        "category_slug": "beef-roasts",
        "short_description": "Traditional salt-cured beef",
        "description": "Premium Australian silverside cured to perfection with traditional spices and salt. This time-honored preparation creates tender, flavorful meat ideal for boiling or slow cooking. Serve hot with vegetables and white sauce, or cold in sandwiches for a classic taste of tradition.",
        "price_aud": 21.99,
        "unit": "kg",
        "weight_kg": 1.5,
        "stock": 70,
        "is_featured": false,
        "image_path": "/images/products/beef/corned-silverside.jpg"
    },
    {
        "name": "Diced Gravy Beef",
        "category_slug": "beef-specialty-cuts",
        "short_description": "Perfect for slow-cooked casseroles",
        "description": "Premium diced Australian grass-fed beef from the shin and shank, perfect for slow-cooked dishes. This economical cut becomes incredibly tender and flavorful when braised, creating rich, hearty gravies. Ideal for traditional stews, pies, and casseroles that require long, slow cooking.",
        "price_aud": 21.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 100,
        "is_featured": false,
        "image_path": "/images/products/beef/diced-gravy-beef.jpg"
    },
    {
        "name": "Lean Diced Chuck",
        "category_slug": "beef-specialty-cuts",
        "short_description": "Premium diced beef for stews",
        "description": "Premium diced Australian chuck steak, expertly trimmed and cubed for your convenience. This flavorful cut from the shoulder is perfect for slow-cooked dishes, developing exceptional tenderness and rich flavor. Ideal for gourmet casseroles, beef bourguignon, and hearty winter stews.",
        "price_aud": 21.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 110,
        "is_featured": false,
        "image_path": "/images/products/beef/lean-diced-chuck.jpg"
    },
    {
        "name": "Lean Diced Beef",
        "category_slug": "beef-specialty-cuts",
        "short_description": "Premium lean beef cubes",
        "description": "High-quality lean Australian beef, expertly diced for maximum convenience and versatility. Sourced from premium cuts and carefully trimmed, this lean beef is perfect for quick stir-fries, kebabs, or slow-cooked curries. A healthy, protein-rich choice that doesn't compromise on flavor.",
        "price_aud": 25.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 90,
        "is_featured": false,
        "image_path": "/images/products/beef/lean-diced-beef.jpg"
    },
    {
        "name": "Beef Stroganoff",
        "category_slug": "beef-specialty-cuts",
        "short_description": "Pre-cut strips ready for stroganoff",
        "description": "Premium Australian beef expertly cut into tender strips, ready for your signature stroganoff. Sourced from quality cuts and perfectly sized for quick cooking, these strips save preparation time while delivering restaurant-quality results. Simply sauté with mushrooms and cream for an elegant meal.",
        "price_aud": 25.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 80,
        "is_featured": false,
        "image_path": "/images/products/beef/beef-stroganoff.jpg"
    },
    {
        "name": "Minute Steak",
        "category_slug": "beef-steaks",
        "short_description": "Thin-cut steak for quick cooking",
        "description": "Thinly sliced Australian grass-fed beef, tenderized for lightning-fast cooking. These versatile steaks are perfect for busy weeknight meals, taking just minutes to pan-fry or grill. Ideal for steak sandwiches, schnitzel-style preparations, or quick protein-packed dinners for the family.",
        "price_aud": 25.99,
        "unit": "kg",
        "weight_kg": 0.3,
        "stock": 100,
        "is_featured": false,
        "image_path": "/images/products/beef/minute-steak.jpg"
    },
    {
        "name": "Lean Gourmet Mince",
        "category_slug": "beef-mince-burgers",
        "short_description": "Premium extra-lean beef mince",
        "description": "Our finest Australian grass-fed beef mince, carefully selected and ground to ensure maximum leanness without sacrificing flavor. Perfect for health-conscious families, this premium mince is ideal for bolognese, tacos, burger patties, and meatballs. Consistently lean, fresh, and full of natural beef flavor.",
        "price_aud": 20.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 150,
        "is_featured": true,
        "image_path": "/images/products/beef/lean-gourmet-mince.jpg"
    },
    {
        "name": "Beef, Bacon & Onion Rissoles",
        "category_slug": "beef-mince-burgers",
        "short_description": "House-made beef patties with bacon",
        "description": "Our signature rissoles made in-house with premium Australian beef, crispy bacon, and caramelized onions. These ready-to-cook patties are seasoned to perfection and bound with quality ingredients. Simply pan-fry or grill for a quick, delicious family meal that rivals restaurant quality.",
        "price_aud": 19.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 80,
        "is_featured": false,
        "image_path": "/images/products/beef/beef-bacon-onion-rissoles.jpg"
    },
    {
        "name": "Steak Dianne",
        "category_slug": "beef-specialty-cuts",
        "short_description": "Premium steaks ready for classic Dianne sauce",
        "description": "Tender Australian beef steaks perfectly cut and prepared for the classic Dianne preparation. These quality cuts are ideal for pan-searing and serving with a rich cream, mustard, and brandy sauce. Restaurant elegance made simple for home cooking.",
        "price_aud": 25.99,
        "unit": "kg",
        "weight_kg": 0.4,
        "stock": 70,
        "is_featured": false,
        "image_path": "/images/products/beef/steak-dianne.jpg"
    },
    {
        "name": "Marinated BBQ Steak",
        "category_slug": "beef-specialty-cuts",
        "short_description": "Pre-marinated steaks ready to grill",
        "description": "Premium Australian beef steaks infused with our signature BBQ marinade blend. Pre-marinated to save you time and deliver maximum flavor, these steaks are ready to throw on the grill. The perfect solution for easy entertaining and weeknight barbecues with guaranteed delicious results.",
        "price_aud": 25.99,
        "unit": "kg",
        "weight_kg": 0.4,
        "stock": 90,
        "is_featured": false,
        "image_path": "/images/products/beef/marinated-bbq-steak.jpg"
    },
    {
        "name": "Marinated Beef Spare Ribs",
        "category_slug": "beef-specialty-cuts",
        "short_description": "Tender ribs in house marinade",
        "description": "Succulent Australian beef spare ribs marinated in our special blend of spices and sauces. These meaty ribs are perfect for slow-roasting or barbecuing, delivering fall-off-the-bone tenderness and bold, smoky flavor. A crowd-pleasing favorite for gatherings and family feasts.",
        "price_aud": 25.99,
        "unit": "kg",
        "weight_kg": 0.8,
        "stock": 60,
        "is_featured": false,
        "image_path": "/images/products/beef/marinated-beef-spare-ribs.jpg"
    },
    {
        "name": "Beef USA Ribs",
        "category_slug": "beef-specialty-cuts",
        "short_description": "Premium beef ribs for smoking and grilling",
        "description": "Premium quality beef ribs perfect for American-style BBQ cooking. These substantial ribs feature excellent meat-to-bone ratio and develop incredible flavor when slow-cooked or smoked. Ideal for creating authentic, tender, juicy BBQ ribs with that signature smoky taste.",
        "price_aud": 21.99,
        "unit": "kg",
        "weight_kg": 1.0,
        "stock": 50,
        "is_featured": false,
        "image_path": "/images/products/beef/beef-usa-ribs.jpg"
    },
    {
        "name": "Beef Stir Fry",
        "category_slug": "beef-specialty-cuts",
        "short_description": "Thinly sliced beef for quick stir-fries",
        "description": "Premium Australian beef sliced paper-thin and ready for instant stir-frying. Cut against the grain for maximum tenderness, these strips cook in minutes and absorb flavors beautifully. Perfect for Asian-inspired dishes, quick weeknight meals, and healthy, protein-packed stir-fries.",
        "price_aud": 25.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 100,
        "is_featured": false,
        "image_path": "/images/products/beef/beef-stir-fry.jpg"
    },
    {
        "name": "Oxtails",
        "category_slug": "beef-specialty-cuts",
        "short_description": "Rich, gelatinous cut for slow cooking",
        "description": "A traditional delicacy prized for its rich, gelatinous meat and incredible depth of flavor. Australian grass-fed oxtails are perfect for slow-braising, creating luxuriously rich stews and soups. The extended cooking time transforms this economical cut into tender, falling-apart meat with unmatched savory flavor.",
        "price_aud": 17.99,
        "unit": "kg",
        "weight_kg": 0.8,
        "stock": 40,
        "is_featured": false,
        "image_path": "/images/products/beef/oxtails.jpg"
    },
    {
        "name": "Ox Kidney",
        "category_slug": "beef-specialty-cuts",
        "short_description": "Traditional offal for classic dishes",
        "description": "Premium Australian ox kidney for traditional British and European dishes. This nutrient-dense organ meat is essential for authentic steak and kidney pies, rich stews, and classic deviled kidneys. Fresh, carefully prepared, and perfect for adventurous cooks seeking authentic flavors.",
        "price_aud": 8.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 30,
        "is_featured": false,
        "image_path": "/images/products/beef/ox-kidney.jpg"
    },
    {
        "name": "Pulled Beef",
        "category_slug": "beef-specialty-cuts",
        "short_description": "Slow-cooked shredded beef ready to serve",
        "description": "Premium Australian beef slow-cooked to perfection and hand-pulled for your convenience. Tender, juicy, and packed with flavor, this ready-to-heat beef is perfect for sandwiches, tacos, nachos, or loaded fries. Restaurant-quality pulled beef that saves you hours of preparation time.",
        "price_aud": 30.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 50,
        "is_featured": false,
        "image_path": "/images/products/beef/pulled-beef.jpg"
    },
    {
        "name": "Beef Brisket",
        "category_slug": "beef-roasts",
        "short_description": "Perfect for smoking and slow roasting",
        "description": "Prime Australian grass-fed beef brisket, the ultimate cut for smoking and slow roasting. This well-marbled cut from the breast transforms into incredibly tender, flavorful meat when cooked low and slow. Perfect for BBQ enthusiasts and traditional Sunday roasts with exceptional results.",
        "price_aud": 22.99,
        "unit": "kg",
        "weight_kg": 2.0,
        "stock": 40,
        "is_featured": false,
        "image_path": "/images/products/beef/beef-brisket.jpg"
    },
    {
        "name": "Beef Osso Bucco",
        "category_slug": "beef-specialty-cuts",
        "short_description": "Cross-cut shanks with marrow bone",
        "description": "Premium cross-cut Australian beef shanks featuring rich, flavorful meat surrounding nutritious marrow-filled bones. Perfect for the classic Italian osso bucco or hearty stews, this cut develops deep, complex flavors during slow braising. The marrow adds luxurious richness to sauces and broths.",
        "price_aud": 21.99,
        "unit": "kg",
        "weight_kg": 0.6,
        "stock": 60,
        "is_featured": false,
        "image_path": "/images/products/beef/beef-osso-bucco.jpg"
    },
    {
        "name": "Skirt Steak",
        "category_slug": "beef-steaks",
        "short_description": "Flavorful cut perfect for fajitas",
        "description": "A thin, flavorful cut from the diaphragm muscle of Australian grass-fed beef, prized for its robust beefy taste. Skirt steak is perfect for quick, high-heat cooking and excels in fajitas, tacos, and Asian stir-fries. Best served medium-rare and sliced against the grain for maximum tenderness.",
        "price_aud": 21.99,
        "unit": "kg",
        "weight_kg": 0.4,
        "stock": 70,
        "is_featured": false,
        "image_path": "/images/products/beef/skirt-steak.jpg"
    },
    {
        "name": "Whole Rump",
        "category_slug": "beef-roasts",
        "short_description": "Large premium roasting joint",
        "description": "A substantial whole rump from premium Australian grass-fed beef, perfect for feeding a crowd. This versatile roast delivers excellent flavor and tenderness, ideal for traditional oven roasting or rotisserie cooking. Can also be portioned into steaks for incredible value and flexibility.",
        "price_aud": 25.99,
        "unit": "kg",
        "weight_kg": 2.5,
        "stock": 30,
        "is_featured": false,
        "image_path": "/images/products/beef/whole-rump.jpg"
    }
]
