[
    {
        "name": "Tasty Rissoles",
        "category_slug": "sausages-beef-sausages",
        "short_description": "Handcrafted beef rissoles with herbs and breadcrumbs",
        "description": "Our signature Tasty Rissoles are handcrafted daily using premium beef mince, freshly blended with aromatic herbs, onions, and quality breadcrumbs. Made fresh every morning by our master butchers, these rissoles are perfect for a quick weeknight dinner or BBQ favorite. No artificial preservatives, just honest, quality ingredients.",
        "price_aud": 19.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 100,
        "is_featured": false,
        "image_path": "/images/products/sausages/tasty-rissoles.jpg"
    },
    {
        "name": "BBQ Rissoles",
        "category_slug": "sausages-beef-sausages",
        "short_description": "Smoky BBQ-flavored beef rissoles with caramelized onions",
        "description": "Experience the rich, smoky flavor of our BBQ Rissoles, handcrafted daily with premium beef and our secret BBQ seasoning blend. Infused with caramelized onions and a hint of smoky paprika, these rissoles bring that authentic BBQ taste to your plate. Made fresh daily using traditional butchery methods and only the finest ingredients.",
        "price_aud": 19.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 100,
        "is_featured": false,
        "image_path": "/images/products/sausages/bbq-rissoles.jpg"
    },
    {
        "name": "Tasty Thick Sausages",
        "category_slug": "sausages-beef-sausages",
        "short_description": "Premium thick beef sausages with classic seasoning",
        "description": "Our Tasty Thick Sausages are a customer favorite, handcrafted daily using premium beef and our traditional family recipe. These thick, juicy sausages are seasoned with a perfect blend of herbs and spices, delivering that classic sausage flavor everyone loves. Made fresh every morning with natural casings for that satisfying snap and superior taste.",
        "price_aud": 19.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 100,
        "is_featured": false,
        "image_path": "/images/products/sausages/tasty-thick-sausages.jpg"
    },
    {
        "name": "Tasty Thin Sausages",
        "category_slug": "sausages-beef-sausages",
        "short_description": "Traditional thin beef sausages, perfect for quick cooking",
        "description": "Our handcrafted Tasty Thin Sausages combine premium beef with our signature blend of herbs and spices. Made fresh daily, these thin sausages cook quickly and evenly, making them perfect for busy families. The natural casings provide that classic snap, while our traditional recipe ensures authentic flavor in every bite.",
        "price_aud": 19.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 100,
        "is_featured": false,
        "image_path": "/images/products/sausages/tasty-thin-sausages.jpg"
    },
    {
        "name": "Fat Free Thin Sausages",
        "category_slug": "sausages-beef-sausages",
        "short_description": "Lean thin sausages for health-conscious meat lovers",
        "description": "Our Fat Free Thin Sausages are handcrafted daily using premium extra-lean beef, specially selected for health-conscious customers who won't compromise on flavor. Made fresh every morning with our signature herb blend and natural casings, these sausages deliver all the taste you love with minimal fat content. Perfect for those watching their diet without sacrificing quality.",
        "price_aud": 20.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 100,
        "is_featured": false,
        "image_path": "/images/products/sausages/fat-free-thin-sausages.jpg"
    },
    {
        "name": "Fat Free Thick Sausages",
        "category_slug": "sausages-beef-sausages",
        "short_description": "Lean thick sausages with full flavor, less fat",
        "description": "Enjoy the best of both worlds with our Fat Free Thick Sausages - handcrafted daily from premium extra-lean beef for a healthier option that doesn't compromise on taste or texture. Made fresh every morning using traditional butchery methods and our special herb blend, these thick sausages are perfect for those seeking a leaner alternative without sacrificing that satisfying bite.",
        "price_aud": 20.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 100,
        "is_featured": false,
        "image_path": "/images/products/sausages/fat-free-thick-sausages.jpg"
    },
    {
        "name": "Old English Pork Sausages",
        "category_slug": "sausages-pork-sausages",
        "short_description": "Traditional pork sausages with heritage recipe",
        "description": "Our Old English Pork Sausages pay homage to traditional British butchery, handcrafted daily using a time-honored recipe passed down through generations. Made with premium pork, sage, and classic English spices, these sausages are prepared fresh every morning using traditional methods. Experience authentic, old-world flavor with every bite.",
        "price_aud": 19.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 100,
        "is_featured": false,
        "image_path": "/images/products/sausages/old-english-pork-sausages.jpg"
    },
    {
        "name": "Mexican Sausages",
        "category_slug": "sausages-gourmet-sausages",
        "short_description": "Spicy gourmet sausages with authentic Mexican flavors",
        "description": "Fire up your taste buds with our handcrafted Mexican Sausages, featuring an authentic blend of premium beef, jalapeños, cumin, paprika, and Mexican spices. Made fresh daily by our expert butchers, these gourmet sausages deliver bold, vibrant flavors that transport you straight to the heart of Mexico. Perfect for adventurous palates seeking something special.",
        "price_aud": 19.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 100,
        "is_featured": true,
        "image_path": "/images/products/sausages/mexican-sausages.jpg"
    },
    {
        "name": "Smokey Bacon Sausages",
        "category_slug": "sausages-pork-sausages",
        "short_description": "Pork sausages infused with smoky bacon pieces",
        "description": "Indulge in our Smokey Bacon Sausages, where premium pork meets crispy bacon in perfect harmony. Handcrafted daily with generous pieces of smoked bacon woven throughout, these sausages are seasoned with a special blend of herbs and spices. Made fresh every morning using traditional methods, they deliver an irresistible smoky flavor that bacon lovers crave.",
        "price_aud": 19.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 100,
        "is_featured": false,
        "image_path": "/images/products/sausages/smokey-bacon-sausages.jpg"
    },
    {
        "name": "Lamb H/M R Sausages",
        "category_slug": "sausages-gourmet-sausages",
        "short_description": "Premium lamb sausages with honey, mustard & rosemary",
        "description": "Our signature Lamb Honey Mustard Rosemary Sausages are a gourmet masterpiece, handcrafted daily using premium lamb and a sophisticated blend of sweet honey, tangy mustard, and fresh rosemary. Made fresh every morning by our master butchers, these artisan sausages offer a refined flavor profile that elevates any meal. A true premium experience for discerning palates.",
        "price_aud": 19.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 100,
        "is_featured": true,
        "image_path": "/images/products/sausages/lamb-honey-mustard-rosemary-sausages.jpg"
    },
    {
        "name": "Sweet Curry Sausages",
        "category_slug": "sausages-gourmet-sausages",
        "short_description": "Aromatic sausages with mild curry and sweet spices",
        "description": "Experience the exotic flavors of our Sweet Curry Sausages, handcrafted daily with tender chicken and a carefully balanced blend of mild curry spices, coconut, and a hint of sweetness. Made fresh every morning using traditional butchery techniques, these unique sausages offer a delightful fusion of flavors that's perfect for those seeking something different. Great for kids and adults alike.",
        "price_aud": 17.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 100,
        "is_featured": false,
        "image_path": "/images/products/sausages/sweet-curry-sausages.jpg"
    },
    {
        "name": "Chicken Sausages",
        "category_slug": "sausages-gourmet-sausages",
        "short_description": "Lean chicken sausages with herbs and garlic",
        "description": "Our Chicken Sausages are handcrafted daily using premium chicken breast, seasoned with a delicate blend of fresh herbs, garlic, and subtle spices. Made fresh every morning, these lean sausages offer a lighter alternative without compromising on flavor. Perfect for health-conscious families seeking quality, handcrafted sausages made with care.",
        "price_aud": 17.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 100,
        "is_featured": false,
        "image_path": "/images/products/sausages/chicken-sausages.jpg"
    },
    {
        "name": "Chicken Rissoles",
        "category_slug": "sausages-gourmet-sausages",
        "short_description": "Tender chicken rissoles with fresh herbs",
        "description": "Our handcrafted Chicken Rissoles combine premium chicken mince with fresh herbs, onions, and quality breadcrumbs for a lighter take on the classic rissole. Made fresh daily by our expert butchers using only natural ingredients, these tender patties are perfect for health-conscious families. No artificial preservatives, just honest, quality chicken prepared the traditional way.",
        "price_aud": 17.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 100,
        "is_featured": false,
        "image_path": "/images/products/sausages/chicken-rissoles.jpg"
    },
    {
        "name": "Sausage Mince",
        "category_slug": "sausages-beef-sausages",
        "short_description": "Premium sausage meat for versatile home cooking",
        "description": "Our Sausage Mince is handcrafted daily using the same premium beef and signature seasoning blend as our famous sausages, but without the casings. Made fresh every morning, this versatile mince is perfect for meatballs, stuffing, pasta sauces, or homemade sausage rolls. The convenience of mince with all the flavor of our artisan sausages.",
        "price_aud": 15.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 100,
        "is_featured": false,
        "image_path": "/images/products/sausages/sausage-mince.jpg"
    }
]
