[
    {
        "name": "Ham off the Bone",
        "category_slug": "deli-sliced-meats",
        "short_description": "Premium slow-cooked ham, sliced to order",
        "description": "Our artisan Ham off the Bone is slow-cooked using traditional methods and carved fresh to order. Made from premium cuts and cured with our secret blend of herbs and spices, this ham delivers authentic, old-world flavor. Hand-sliced in our deli for maximum freshness and superior texture. Perfect for sandwiches, platters, or enjoying on its own.",
        "price_aud": 25.99,
        "unit": "kg",
        "weight_kg": 0.25,
        "stock": 50,
        "is_featured": false,
        "image_path": "/images/products/deli/ham-off-the-bone.jpg"
    },
    {
        "name": "Smoked Bacon",
        "category_slug": "deli-sliced-meats",
        "short_description": "Traditional smoked bacon with rich flavor",
        "description": "Our Smoked Bacon is prepared using traditional smoking methods, creating that authentic smoky flavor bacon lovers crave. Carefully cured with our artisan blend of seasonings and slow-smoked over natural hardwood, each slice delivers rich, complex flavors. Sliced to your preferred thickness in our deli for the ultimate freshness.",
        "price_aud": 19.99,
        "unit": "kg",
        "weight_kg": 0.3,
        "stock": 75,
        "is_featured": false,
        "image_path": "/images/products/deli/smoked-bacon.jpg"
    },
    {
        "name": "Pepperoni",
        "category_slug": "deli-sliced-meats",
        "short_description": "Spicy Italian-style pepperoni, sliced fresh",
        "description": "Our artisan Pepperoni is crafted using authentic Italian methods, combining premium beef and pork with traditional spices, paprika, and chili. Carefully cured and air-dried to perfection, this pepperoni delivers bold, spicy flavor with each slice. Hand-sliced fresh in our deli, it's perfect for pizzas, antipasto platters, or simply enjoyed as a snack.",
        "price_aud": 25.99,
        "unit": "kg",
        "weight_kg": 0.2,
        "stock": 50,
        "is_featured": false,
        "image_path": "/images/products/deli/pepperoni.jpg"
    },
    {
        "name": "Cabonosi",
        "category_slug": "deli-sliced-meats",
        "short_description": "Premium Italian-style dry cured salami",
        "description": "Our Cabonosi is a traditional Italian-style salami, expertly crafted using premium pork and our artisan blend of Mediterranean spices. Slowly cured and air-dried following time-honored methods, this salami develops rich, complex flavors and perfect texture. Hand-sliced to order in our deli for maximum freshness. An authentic taste of Italy.",
        "price_aud": 25.99,
        "unit": "kg",
        "weight_kg": 0.2,
        "stock": 50,
        "is_featured": false,
        "image_path": "/images/products/deli/cabonosi.jpg"
    },
    {
        "name": "Kransky",
        "category_slug": "deli-sliced-meats",
        "short_description": "Traditional European smoked sausage",
        "description": "Our Kransky is a traditional European-style smoked sausage, crafted using premium pork and our artisan blend of garlic and spices. Slowly smoked using traditional methods over natural hardwood, these sausages develop a distinctive smoky flavor and satisfying snap. Perfect heated on the BBQ or sliced cold for platters.",
        "price_aud": 25.99,
        "unit": "kg",
        "weight_kg": 0.3,
        "stock": 60,
        "is_featured": false,
        "image_path": "/images/products/deli/kransky.jpg"
    },
    {
        "name": "Ham Hocks",
        "category_slug": "deli-sliced-meats",
        "short_description": "Smoked ham hocks perfect for soups and stews",
        "description": "Our Ham Hocks are expertly prepared and slow-smoked using traditional methods, delivering rich, smoky flavor perfect for enhancing soups, stews, and traditional dishes. These meaty cuts add incredible depth and flavor to slow-cooked meals. A staple ingredient that brings authentic, old-world taste to your cooking.",
        "price_aud": 11.99,
        "unit": "kg",
        "weight_kg": 0.6,
        "stock": 40,
        "is_featured": false,
        "image_path": "/images/products/deli/ham-hocks.jpg"
    },
    {
        "name": "Bacon Bones",
        "category_slug": "deli-sliced-meats",
        "short_description": "Smoked bacon bones for flavoring soups and broths",
        "description": "Our Bacon Bones are traditionally smoked and perfect for adding rich, smoky flavor to soups, broths, and bean dishes. These meaty bones are carefully prepared using artisan smoking methods that infuse deep flavor. An economical way to bring authentic bacon taste to your slow-cooked favorites and traditional recipes.",
        "price_aud": 8.99,
        "unit": "kg",
        "weight_kg": 0.8,
        "stock": 50,
        "is_featured": false,
        "image_path": "/images/products/deli/bacon-bones.jpg"
    },
    {
        "name": "Leg Hams",
        "category_slug": "deli-sliced-meats",
        "short_description": "Premium whole leg hams for special occasions",
        "description": "Our premium Leg Hams are the centerpiece of any celebration. Expertly prepared using traditional curing methods and slow-cooked to perfection, these whole hams deliver authentic flavor and tender texture. Perfect for holidays, family gatherings, and special occasions. Available whole or carved to your requirements.",
        "price_aud": 25.99,
        "unit": "kg",
        "weight_kg": 4.0,
        "stock": 20,
        "is_featured": false,
        "image_path": "/images/products/deli/leg-hams.jpg"
    },
    {
        "name": "Roast Beef",
        "category_slug": "deli-sliced-meats",
        "short_description": "Premium slow-roasted beef, hand-carved daily",
        "description": "Our signature Roast Beef is crafted from premium beef cuts, seasoned with our artisan herb blend and slow-roasted to perfection using traditional methods. Hand-carved fresh daily in our deli for exceptional tenderness and flavor. Each slice showcases the quality of our carefully selected beef and expert preparation. A true premium deli experience.",
        "price_aud": 34.99,
        "unit": "kg",
        "weight_kg": 0.25,
        "stock": 40,
        "is_featured": true,
        "image_path": "/images/products/deli/roast-beef.jpg"
    },
    {
        "name": "Roast Pork",
        "category_slug": "deli-sliced-meats",
        "short_description": "Tender slow-roasted pork with crackling",
        "description": "Our artisan Roast Pork is slow-roasted using traditional methods, creating tender, succulent meat with perfectly crispy crackling. Seasoned with our special blend of herbs and spices, then roasted to perfection daily. Hand-carved fresh in our deli for maximum flavor and texture. Perfect for sandwiches or elegant platters.",
        "price_aud": 31.99,
        "unit": "kg",
        "weight_kg": 0.25,
        "stock": 40,
        "is_featured": false,
        "image_path": "/images/products/deli/roast-pork.jpg"
    },
    {
        "name": "Eye Bacon",
        "category_slug": "deli-sliced-meats",
        "short_description": "Premium lean bacon from the eye of the loin",
        "description": "Our Eye Bacon is cut from the premium eye of the pork loin, offering the leanest, most tender bacon available. Carefully cured using our artisan methods and sliced to order for exceptional freshness. This premium cut delivers superior flavor with minimal fat, perfect for bacon lovers seeking the highest quality.",
        "price_aud": 17.99,
        "unit": "kg",
        "weight_kg": 0.3,
        "stock": 60,
        "is_featured": false,
        "image_path": "/images/products/deli/eye-bacon.jpg"
    }
]
