[
    {
        "name": "Chicken Breast Fillets",
        "category_slug": "chicken-breast",
        "short_description": "Premium free-range chicken breast fillets, tender and lean",
        "description": "Our premium chicken breast fillets are sourced from free-range chickens, ensuring superior quality and flavor. These lean, versatile fillets are perfect for grilling, baking, stir-frying, or pan-frying. Each fillet is carefully trimmed and ready to cook. A healthy protein option that's perfect for any meal.",
        "price_aud": 17.99,
        "unit": "kg",
        "weight_kg": 0.6,
        "stock": 200,
        "is_featured": true,
        "image_path": "/images/products/poultry/chicken-breast-fillets.jpg"
    },
    {
        "name": "Chicken Thigh Fillets",
        "category_slug": "chicken-thigh-drumsticks",
        "short_description": "Succulent free-range chicken thigh fillets, boneless",
        "description": "Our free-range chicken thigh fillets offer richer flavor and superior juiciness compared to breast meat. These boneless, skinless fillets are incredibly versatile and stay moist during cooking. Perfect for curries, stir-fries, grilling, or baking. The natural fat content ensures tender, flavorful results every time.",
        "price_aud": 17.99,
        "unit": "kg",
        "weight_kg": 0.7,
        "stock": 180,
        "is_featured": false,
        "image_path": "/images/products/poultry/chicken-thigh-fillets.jpg"
    },
    {
        "name": "Crumbed Chicken Fillets",
        "category_slug": "chicken-breast",
        "short_description": "Premium chicken breast fillets, pre-crumbed for convenience",
        "description": "Our crumbed chicken fillets feature premium free-range chicken breast coated in golden breadcrumbs. Ready to cook - simply bake or pan-fry for a crispy, golden exterior and tender interior. Perfect for schnitzels, chicken burgers, or a quick family dinner. Restaurant quality made easy.",
        "price_aud": 17.99,
        "unit": "kg",
        "weight_kg": 0.6,
        "stock": 150,
        "is_featured": false,
        "image_path": "/images/products/poultry/crumbed-chicken-fillets.jpg"
    },
    {
        "name": "Lemon & Parsley Chicken Fillets",
        "category_slug": "chicken-breast",
        "short_description": "Chicken fillets marinated in zesty lemon and fresh herbs",
        "description": "Our lemon and parsley chicken fillets are marinated in a refreshing blend of zesty lemon, fresh parsley, and aromatic herbs. These premium free-range fillets are ready to cook, offering bright, fresh flavors with minimal effort. Perfect for a healthy, flavorful meal that the whole family will enjoy.",
        "price_aud": 17.99,
        "unit": "kg",
        "weight_kg": 0.6,
        "stock": 120,
        "is_featured": false,
        "image_path": "/images/products/poultry/lemon-parsley-chicken-fillets.jpg"
    },
    {
        "name": "Glazed Chicken Fillets",
        "category_slug": "chicken-breast",
        "short_description": "Chicken fillets with sweet and savory glaze marinade",
        "description": "Our glazed chicken fillets are marinated in our signature sweet and savory glaze, creating caramelized perfection when cooked. These premium free-range fillets are ready to grill, bake, or pan-fry. The glaze adds beautiful color and incredible flavor, making this a family favorite.",
        "price_aud": 17.99,
        "unit": "kg",
        "weight_kg": 0.6,
        "stock": 130,
        "is_featured": false,
        "image_path": "/images/products/poultry/glazed-chicken-fillets.jpg"
    },
    {
        "name": "Honey Soy Chicken Kebabs",
        "category_slug": "chicken-breast",
        "short_description": "Skewered chicken pieces in honey soy marinade",
        "description": "Our honey soy chicken kebabs feature tender pieces of free-range chicken breast marinated in a delicious honey soy sauce and threaded onto skewers. Perfect for grilling or BBQ, these kebabs are ready to cook and offer authentic Asian-inspired flavors. Great for entertaining or family dinners.",
        "price_aud": 15.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 140,
        "is_featured": false,
        "image_path": "/images/products/poultry/honey-soy-chicken-kebabs.jpg"
    },
    {
        "name": "Satay Chicken Kebabs",
        "category_slug": "chicken-breast",
        "short_description": "Skewered chicken in authentic satay marinade",
        "description": "Our satay chicken kebabs feature tender chicken pieces marinated in our authentic satay sauce with peanut and spice flavors. Pre-skewered and ready to grill or BBQ. These kebabs bring the flavors of Southeast Asia to your table with minimal effort. Serve with extra satay sauce for dipping.",
        "price_aud": 15.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 135,
        "is_featured": false,
        "image_path": "/images/products/poultry/satay-chicken-kebabs.jpg"
    },
    {
        "name": "Chicken Cutlets",
        "category_slug": "chicken-breast",
        "short_description": "Tender chicken cutlets, perfect for schnitzels",
        "description": "Our chicken cutlets are premium free-range chicken breast, tenderized and ready for crumbing or marinating. These thin, uniform cutlets cook quickly and evenly, making them perfect for schnitzels, stir-fries, or any recipe requiring tender chicken. A versatile option for quick weeknight meals.",
        "price_aud": 17.99,
        "unit": "kg",
        "weight_kg": 0.6,
        "stock": 160,
        "is_featured": false,
        "image_path": "/images/products/poultry/chicken-cutlets.jpg"
    },
    {
        "name": "Apricot French Onion Chicken Cutlets",
        "category_slug": "chicken-breast",
        "short_description": "Cutlets marinated in sweet apricot and French onion blend",
        "description": "Our apricot French onion chicken cutlets combine sweet apricot with savory French onion for a unique, delicious flavor profile. These premium free-range cutlets are pre-marinated and ready to cook. The sweet and savory combination creates a restaurant-quality dish with minimal effort.",
        "price_aud": 17.99,
        "unit": "kg",
        "weight_kg": 0.6,
        "stock": 110,
        "is_featured": false,
        "image_path": "/images/products/poultry/apricot-french-onion-chicken-cutlets.jpg"
    },
    {
        "name": "Chicken Filos",
        "category_slug": "chicken-breast",
        "short_description": "Gourmet chicken wrapped in crispy filo pastry",
        "description": "Our chicken filos feature tender, seasoned free-range chicken wrapped in delicate, crispy filo pastry. These gourmet parcels are perfect for entertaining or as a special dinner option. Simply bake until golden and crispy for an impressive meal that looks as good as it tastes.",
        "price_aud": 19.99,
        "unit": "kg",
        "weight_kg": 0.4,
        "stock": 90,
        "is_featured": true,
        "image_path": "/images/products/poultry/chicken-filos.jpg"
    },
    {
        "name": "Whole Chicken",
        "category_slug": "chicken-whole-chicken",
        "short_description": "Premium free-range whole chicken, ready to roast",
        "description": "Our premium free-range whole chickens are perfect for roasting, offering superior flavor and quality. Each bird is carefully selected for optimal size and freshness. Roast whole for Sunday dinner, or cut into pieces for various cooking methods. Free-range means better flavor and texture throughout.",
        "price_aud": 14.99,
        "unit": "kg",
        "weight_kg": 1.8,
        "stock": 100,
        "is_featured": true,
        "image_path": "/images/products/poultry/whole-chicken.jpg"
    },
    {
        "name": "Chicken Satay Stir Fry",
        "category_slug": "chicken-breast",
        "short_description": "Sliced chicken in satay marinade, perfect for stir-frying",
        "description": "Our chicken satay stir fry features thinly sliced free-range chicken breast marinated in authentic satay sauce. Ready to stir-fry with your favorite vegetables for a quick, delicious meal. The thin slices cook in minutes and are packed with flavor. Perfect for busy weeknights.",
        "price_aud": 17.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 125,
        "is_featured": false,
        "image_path": "/images/products/poultry/chicken-satay-stir-fry.jpg"
    },
    {
        "name": "Chicken Drumsticks",
        "category_slug": "chicken-thigh-drumsticks",
        "short_description": "Free-range chicken drumsticks, great value and flavor",
        "description": "Our free-range chicken drumsticks are a family favorite, offering great value and excellent flavor. Perfect for baking, grilling, or BBQ, these drumsticks are juicy and tender with crispy skin when cooked. Kids love them, and they're budget-friendly without compromising on quality.",
        "price_aud": 8.99,
        "unit": "kg",
        "weight_kg": 0.8,
        "stock": 220,
        "is_featured": false,
        "image_path": "/images/products/poultry/chicken-drumsticks.jpg"
    },
    {
        "name": "Chicken Wings",
        "category_slug": "chicken-wings",
        "short_description": "Free-range chicken wings, perfect for party platters",
        "description": "Our free-range chicken wings are perfect for game day, parties, or casual dinners. These versatile wings can be grilled, baked, or fried and pair perfectly with any sauce or seasoning. The higher fat content ensures they stay juicy and flavorful. A crowd-pleasing favorite at great value.",
        "price_aud": 8.99,
        "unit": "kg",
        "weight_kg": 1.0,
        "stock": 250,
        "is_featured": false,
        "image_path": "/images/products/poultry/chicken-wings.jpg"
    },
    {
        "name": "Chicken Wingettes",
        "category_slug": "chicken-wings",
        "short_description": "Premium wingettes, the meatiest part of the wing",
        "description": "Our chicken wingettes are the middle section of the wing - the meatiest and most prized part. These free-range wingettes are perfect for buffalo wings, sticky Asian-style wings, or any wing recipe. More meat, less hassle, and always delicious. Ideal for entertaining or as a main course.",
        "price_aud": 9.99,
        "unit": "kg",
        "weight_kg": 0.9,
        "stock": 180,
        "is_featured": false,
        "image_path": "/images/products/poultry/chicken-wingettes.jpg"
    },
    {
        "name": "Chicken Tenderloins",
        "category_slug": "chicken-breast",
        "short_description": "Premium chicken tenderloins, the most tender cut",
        "description": "Our chicken tenderloins are the small, incredibly tender strip found under the chicken breast. These premium free-range tenderloins are perfect for quick cooking - ideal for stir-fries, schnitzels, or kid-friendly chicken fingers. Their natural tenderness and mild flavor make them a versatile favorite.",
        "price_aud": 19.99,
        "unit": "kg",
        "weight_kg": 0.45,
        "stock": 130,
        "is_featured": false,
        "image_path": "/images/products/poultry/chicken-tenderloins.jpg"
    },
    {
        "name": "Crumbed Chicken Tenderloins",
        "category_slug": "chicken-breast",
        "short_description": "Pre-crumbed chicken tenderloins, ready to cook",
        "description": "Our crumbed chicken tenderloins feature premium free-range tenderloins coated in golden breadcrumbs. Perfect for chicken fingers, schnitzels, or as a quick meal option. Simply bake or pan-fry for crispy, golden results. Kids and adults alike love these convenient, delicious tenderloins.",
        "price_aud": 17.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 140,
        "is_featured": false,
        "image_path": "/images/products/poultry/crumbed-chicken-tenderloins.jpg"
    },
    {
        "name": "Lovely Legs",
        "category_slug": "chicken-thigh-drumsticks",
        "short_description": "Chicken leg quarters with thigh and drumstick",
        "description": "Our 'Lovely Legs' are premium free-range chicken leg quarters featuring both the thigh and drumstick. These cuts offer rich flavor and juicy meat, perfect for baking, roasting, or grilling. The combination of dark meat ensures maximum flavor and tenderness. Great value for families.",
        "price_aud": 8.99,
        "unit": "kg",
        "weight_kg": 0.9,
        "stock": 190,
        "is_featured": false,
        "image_path": "/images/products/poultry/lovely-legs.jpg"
    }
]
