[
    {
        "name": "Pork Loin Chops",
        "category_slug": "pork-chops-steaks",
        "short_description": "Premium tender pork loin chops, perfect for grilling",
        "description": "Our premium pork loin chops are cut from the finest quality pork, offering exceptional tenderness and flavor. These chops are ideal for grilling, pan-frying, or baking. Each chop is carefully trimmed to ensure consistent quality and cooking results. Perfect for a quick weeknight dinner or special occasion.",
        "price_aud": 24.99,
        "unit": "kg",
        "weight_kg": 0.6,
        "stock": 150,
        "is_featured": true,
        "image_path": "/images/products/pork/pork-loin-chops.jpg"
    },
    {
        "name": "Pork Forequarter Chops",
        "category_slug": "pork-chops-steaks",
        "short_description": "Flavorful forequarter chops with excellent marbling",
        "description": "Our pork forequarter chops offer rich flavor and excellent marbling, making them juicy and delicious. Cut from the shoulder region, these chops are perfect for slow cooking, braising, or grilling. The natural fat content ensures they stay moist and tender during cooking.",
        "price_aud": 23.99,
        "unit": "kg",
        "weight_kg": 0.65,
        "stock": 120,
        "is_featured": false,
        "image_path": "/images/products/pork/pork-forequarter-chops.jpg"
    },
    {
        "name": "Chilli Pineapple Pork Chops",
        "category_slug": "pork-chops-steaks",
        "short_description": "Premium chops marinated in sweet chilli pineapple glaze",
        "description": "Experience a tropical twist with our signature chilli pineapple pork chops. These premium cuts are marinated in our special blend of sweet pineapple and mild chilli, creating a perfect balance of sweet and spicy flavors. Simply cook and enjoy this restaurant-quality meal at home.",
        "price_aud": 24.99,
        "unit": "kg",
        "weight_kg": 0.6,
        "stock": 80,
        "is_featured": false,
        "image_path": "/images/products/pork/chilli-pineapple-pork-chops.jpg"
    },
    {
        "name": "Pork Butterfly Steak",
        "category_slug": "pork-chops-steaks",
        "short_description": "Tender butterflied pork steak, perfect for quick cooking",
        "description": "Our pork butterfly steaks are expertly cut and butterflied for quick, even cooking. These tender cuts are ideal for grilling or pan-frying and cook in minutes. The butterflied design ensures consistent thickness throughout, resulting in perfectly cooked, juicy pork every time.",
        "price_aud": 30.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 100,
        "is_featured": false,
        "image_path": "/images/products/pork/pork-butterfly-steak.jpg"
    },
    {
        "name": "Pork Fillet",
        "category_slug": "pork-chops-steaks",
        "short_description": "Premium lean pork fillet, the most tender cut",
        "description": "The crown jewel of pork cuts, our pork fillet is incredibly tender and lean. Also known as tenderloin, this premium cut is perfect for special occasions. Its mild flavor and melt-in-your-mouth texture make it ideal for roasting whole or slicing into medallions. A true delicacy for discerning palates.",
        "price_aud": 28.99,
        "unit": "kg",
        "weight_kg": 0.45,
        "stock": 60,
        "is_featured": true,
        "image_path": "/images/products/pork/pork-fillet.jpg"
    },
    {
        "name": "Pork Medallions",
        "category_slug": "pork-chops-steaks",
        "short_description": "Elegant pork medallions cut from premium fillet",
        "description": "Our pork medallions are cut from premium pork fillet, offering restaurant-quality portions that cook quickly and evenly. These elegant cuts are perfect for pan-searing with your favorite sauce or marinade. Their uniform size ensures consistent cooking, making them ideal for entertaining or a special dinner at home.",
        "price_aud": 30.99,
        "unit": "kg",
        "weight_kg": 0.4,
        "stock": 70,
        "is_featured": true,
        "image_path": "/images/products/pork/pork-medallions.jpg"
    },
    {
        "name": "Pork Neck",
        "category_slug": "pork-chops-steaks",
        "short_description": "Flavorful pork neck, perfect for slow cooking",
        "description": "Our pork neck is a butcher's favorite for slow cooking and braising. This cut offers exceptional flavor and becomes incredibly tender when cooked low and slow. Perfect for pulled pork, stews, or roasting. The natural marbling ensures moist, succulent results every time.",
        "price_aud": 24.99,
        "unit": "kg",
        "weight_kg": 0.8,
        "stock": 90,
        "is_featured": false,
        "image_path": "/images/products/pork/pork-neck.jpg"
    },
    {
        "name": "Lean Diced Pork",
        "category_slug": "pork-chops-steaks",
        "short_description": "Premium diced pork ready for stir-fries and curries",
        "description": "Our lean diced pork is carefully trimmed and cubed for your convenience. Perfect for stir-fries, curries, kebabs, or casseroles. Each piece is uniformly cut to ensure even cooking. Save time in the kitchen with this versatile, ready-to-cook option.",
        "price_aud": 24.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 110,
        "is_featured": false,
        "image_path": "/images/products/pork/lean-diced-pork.jpg"
    },
    {
        "name": "Pork Stir Fry",
        "category_slug": "pork-chops-steaks",
        "short_description": "Thinly sliced pork strips, perfect for quick stir-fries",
        "description": "Our pork stir fry strips are thinly sliced for quick cooking and maximum flavor absorption. Perfect for Asian-inspired dishes, these tender strips cook in minutes and pair beautifully with any vegetables or sauce. A convenient solution for busy weeknight meals.",
        "price_aud": 24.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 100,
        "is_featured": false,
        "image_path": "/images/products/pork/pork-stir-fry.jpg"
    },
    {
        "name": "Pork Spare Ribs",
        "category_slug": "pork-ribs",
        "short_description": "Succulent pork spare ribs, ideal for BBQ",
        "description": "Our premium pork spare ribs are cut from the belly, offering excellent meat-to-bone ratio and rich flavor. Perfect for slow cooking, smoking, or grilling with your favorite BBQ sauce. These ribs are tender, juicy, and guaranteed to be the star of your next cookout or family dinner.",
        "price_aud": 24.99,
        "unit": "kg",
        "weight_kg": 1.0,
        "stock": 130,
        "is_featured": false,
        "image_path": "/images/products/pork/pork-spare-ribs.jpg"
    },
    {
        "name": "Marinated Pork Spare Ribs",
        "category_slug": "pork-ribs",
        "short_description": "Spare ribs pre-marinated in our signature BBQ sauce",
        "description": "Experience convenience without compromising on flavor with our marinated pork spare ribs. Pre-marinated in our signature BBQ sauce blend, these ribs are ready to cook straight from the pack. Simply grill, bake, or BBQ for fall-off-the-bone tenderness and mouthwatering flavor.",
        "price_aud": 24.99,
        "unit": "kg",
        "weight_kg": 1.0,
        "stock": 95,
        "is_featured": false,
        "image_path": "/images/products/pork/marinated-pork-spare-ribs.jpg"
    },
    {
        "name": "Pork USA Ribs",
        "category_slug": "pork-ribs",
        "short_description": "American-style pork ribs with excellent meat coverage",
        "description": "Our USA-style pork ribs are cut American-style with generous meat coverage. These ribs offer exceptional value and are perfect for long, slow cooking methods. Whether you're smoking, braising, or baking, these ribs deliver tender, flavorful results that will impress your guests.",
        "price_aud": 21.99,
        "unit": "kg",
        "weight_kg": 1.2,
        "stock": 85,
        "is_featured": false,
        "image_path": "/images/products/pork/pork-usa-ribs.jpg"
    },
    {
        "name": "H/M Pork Rissoles (Honey Mustard)",
        "category_slug": "pork-bacon-ham",
        "short_description": "Homemade honey mustard pork rissoles, ready to cook",
        "description": "Our homemade honey mustard pork rissoles are crafted in-house using premium pork mince and our special honey mustard seasoning. These pre-formed patties are ready to cook - simply grill, pan-fry, or bake. Perfect for quick weeknight dinners, burgers, or a family BBQ.",
        "price_aud": 19.99,
        "unit": "kg",
        "weight_kg": 0.6,
        "stock": 120,
        "is_featured": false,
        "image_path": "/images/products/pork/honey-mustard-pork-rissoles.jpg"
    },
    {
        "name": "Rolled Pork Roast",
        "category_slug": "pork-roasts",
        "short_description": "Premium rolled pork roast with perfect crackling",
        "description": "Our rolled pork roast is expertly prepared with scored skin for perfect crackling. This premium roast is ideal for Sunday dinners or special occasions. The rolled design ensures even cooking and easy carving. Roast to golden perfection for tender, juicy meat with crispy, crackling skin.",
        "price_aud": 24.99,
        "unit": "kg",
        "weight_kg": 1.5,
        "stock": 75,
        "is_featured": false,
        "image_path": "/images/products/pork/rolled-pork-roast.jpg"
    },
    {
        "name": "Leg of Pork",
        "category_slug": "pork-roasts",
        "short_description": "Traditional leg of pork roast, perfect for gatherings",
        "description": "Our leg of pork is a traditional favorite, perfect for feeding a crowd. This generous cut offers excellent value and incredible flavor. Ideal for slow roasting, this cut becomes tender and succulent while developing a beautiful golden crust. Perfect for Sunday roasts or festive celebrations.",
        "price_aud": 21.99,
        "unit": "kg",
        "weight_kg": 2.0,
        "stock": 50,
        "is_featured": false,
        "image_path": "/images/products/pork/leg-of-pork.jpg"
    },
    {
        "name": "Pork Schnitzel",
        "category_slug": "pork-chops-steaks",
        "short_description": "Premium pork schnitzel, tenderized and ready to crumb",
        "description": "Our pork schnitzel is tenderized and ready for you to crumb and cook. These thin, tender cuts are perfect for creating traditional European-style schnitzels. Coat in breadcrumbs and pan-fry for a crispy, golden exterior and juicy interior. A family favorite that's quick and easy to prepare.",
        "price_aud": 24.99,
        "unit": "kg",
        "weight_kg": 0.5,
        "stock": 105,
        "is_featured": false,
        "image_path": "/images/products/pork/pork-schnitzel.jpg"
    },
    {
        "name": "Pulled Pork",
        "category_slug": "pork-bacon-ham",
        "short_description": "Slow-cooked pulled pork, ready to heat and serve",
        "description": "Our premium pulled pork is slow-cooked to perfection, tender and full of flavor. This ready-to-eat product is perfect for sandwiches, tacos, sliders, or as a main dish. Simply heat and serve for a convenient, restaurant-quality meal. Seasoned with our special spice blend for authentic BBQ flavor.",
        "price_aud": 26.99,
        "unit": "kg",
        "weight_kg": 0.8,
        "stock": 65,
        "is_featured": false,
        "image_path": "/images/products/pork/pulled-pork.jpg"
    },
    {
        "name": "Pulled Pork Parcels",
        "category_slug": "pork-bacon-ham",
        "short_description": "Individual pulled pork parcels, perfect for snacks",
        "description": "Our pulled pork parcels are convenient individual servings of our signature slow-cooked pulled pork wrapped in flaky pastry. Perfect for lunch boxes, snacks, or light meals. These ready-to-heat parcels offer all the flavor of our famous pulled pork in a convenient, portable format.",
        "price_aud": 4.99,
        "unit": "each",
        "weight_kg": 0.2,
        "stock": 200,
        "is_featured": false,
        "image_path": "/images/products/pork/pulled-pork-parcels.jpg"
    }
]
